app/controllers/emails_controller.rb

def show

	@current_email = Email.find(params[:id])
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def destroy
		@current_email = Email.find(params[:id])
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]