app/views/emails/create.js.erb

<% @email =  Email.create(object: Faker::Science.element, body: Faker::Address.full_address) %>

document.getElementById("email").insertAdjacentHTML("beforeend", "<%= j render 'email', email: @email %>" )
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "Copernicium"], ["body", "963 Beahan Brook, New Eugene, MD 25169-2028"], ["created_at", "2019-05-23 10:40:43.113720"], ["updated_at", "2019-05-23 10:40:43.113720"]]
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "Cesium"], ["body", "26987 Barrows Motorway, Berniershire, WY 24772"], ["created_at", "2019-05-23 11:10:56.731532"], ["updated_at", "2019-05-23 11:10:56.731532"]]