app/views/emails/destroy.js.erb

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
<% 		@current_email = Email.find(params[:id]) %>

DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 5]]
---

document.getElementById("<%= @current_email_id%>").destroy