app/views/emails/destroy.html.erb

<% @current_email.destroy %>
---
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 4]]